УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_ПодключаемыйМодуль/КонтурЗакупки_ПодключаемыйМодуль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурЗакупки_ПодключаемыйМодуль</name>
</mdclass:DataProcessor>

УТ.КонтурЗакупки/src/Enums/КонтурЗакупки_ТипыПМ/КонтурЗакупки_ТипыПМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЗакупки_ТипыПМ</name>
  <enumValues>
    <name>Отключен</name>
  </enumValues>
  <enumValues>
    <name>ВСоставеКонфигурации</name>
  </enumValues>
  <enumValues>
    <name>ФайлНаДиске</name>
  </enumValues>
  <enumValues>
    <name>ВСправочнике</name>
  </enumValues>
</mdclass:Enum>

УТ.КонтурЗакупки/src/DataProcessors/КонтурЗакупки_ПодключаемыйМодуль/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеПараметровПМ" Тогда

		ПеречитатьНастройки();
		ОбновитьОтображениеДанных();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПеречитатьНастройки();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура СброситьКэш(Команда)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПМВФайл(Команда)

	ОповещениеОВыбореКаталога = Новый ОписаниеОповещения("СохранитьПМВФайлОбработатьВыборКаталога", ЭтаФорма);

	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Показать(ОповещениеОВыбореКаталога);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура СохранитьПМВФайлОбработатьВыборКаталога(ВыбранныеФайлы, ДополнительныеПараметры = Неопределено) Экспорт

	Если ЗначениеЗаполнено(ВыбранныеФайлы) Тогда

		ИмяКаталога = ВыбранныеФайлы[0];
		ИмяФайла = ИмяКаталога + ПолучитьРазделительПути() + "КонтурЗакупки_ПодключаемыйМодуль.epf";

		Попытка

			ЗаписатьПМНаДиск(ИмяФайла);
			ЗапуститьПриложение(ИмяКаталога);

			ОповещениеВопросОПодключении = Новый ОписаниеОповещения("ПодключитьКакФайлОбработатьОтвет", ЭтаФорма,
				ИмяФайла);

			ПоказатьВопрос(ОповещениеВопросОПодключении, "Подключить сохраненный ПМ как файл?",
				РежимДиалогаВопрос.ДаНет, , , "Сразу подключим?");
		Исключение

			Сообщить(ОписаниеОшибки());

		КонецПопытки;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьКакФайлОбработатьОтвет(ПодключитьКакФайл, ИмяФайла) Экспорт

	Если ПодключитьКакФайл = КодВозвратаДиалога.Да Тогда

		ПодключитьКакФайлСервер(ИмяФайла);
		ПеречитатьНастройки();
		ОбновитьОтображениеДанных();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПодключитьКакФайлСервер(ИмяФайла)

	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("ПодключаемыйМодульТип",
		Перечисления.КонтурЗакупки_ТипыПМ.ФайлНаДиске);

	КонтурЗакупки_НастройкиВызовСервера.УстановитьЗначениеНастройки("ПодключаемыйМодульПуть", ИмяФайла);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПМНаДиск(ПутьКФайлу)

	Обработки.КонтурЗакупки_ПодключаемыйМодуль.ПолучитьМакет("ШаблонПодключаемогоМодуля").Записать(ПутьКФайлу);

КонецПроцедуры

&НаСервере
Процедура ПеречитатьНастройки()

	НастройкаПутьДоФайлаЗначение = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки(
		"ПодключаемыйМодульПуть", "");

	НастройкаТипПМЗначение = КонтурЗакупки_НастройкиВызовСервера.ПолучитьЗначениеНастройки("ПодключаемыйМодульТип",
		Перечисления.КонтурЗакупки_ТипыПМ.ВСоставеКонфигурации);

	СведенияОбОбработке = КонтурЗакупки_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"СведенияОВнешнейОбработке");
	ЗаголовокВерсии  = " не подключен";
	Если СведенияОбОбработке <> Неопределено Тогда
		Попытка
			ЗаголовокВерсии = " подключен v " + СведенияОбОбработке.Версия;
		Исключение
			ЗаголовокВерсии = " не удалось подключить";
		КонецПопытки;
	КонецЕсли;

	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Этаформа.Заголовок = ОбъектОбработки.Метаданные().Синоним + ":" + ЗаголовокВерсии;
КонецПроцедуры
#КонецОбласти
